using Xunit;

namespace ShabadOS.GurmukhiUtils.Test
{
    public class HindiTests
    {
        [Fact]
        public void ToHindi()
        {
            var words = new[]
            {
                new { Gurmukhi = "ਖੋਜ", Hindi = "खोज" },
                new { Gurmukhi = "ਹਿਰ", Hindi = "हिर" },
                new { Gurmukhi = "ਮਿਲੵਿੋ", Hindi = "मिल्यिो" },
                new { Gurmukhi = "ਕੁਲ ਜਨ ਮਧੇ ਮਿਲੵਿੋ ਸਾਰਗ ਪਾਨ ਰੇ ॥", Hindi = "कुल जन मधे मिल्यिो सारग पान रे ॥" },
                new { Gurmukhi = "ਤੂ ਪ੍ਰਭ ਦਾਤਾ ਦਾਨਿ ਮਤਿ ਪੂਰਾ ਹਮ ਥਾਰੇ ਭੇਖਾਰੀ ਜੀਉ ॥", Hindi = "तू प्रभ दाता दानि मति पूरा हम थारे भेखारी जीउ ॥" },
                new { Gurmukhi = "ਸੋ ਬ੍ਰਹਮੁ ਅਜੋਨੀ ਹੈ ਭੀ ਹੋਨੀ ਘਟ ਭੀਤਰਿ ਦੇਖੁ ਮੁਰਾਰੀ ਜੀਉ ॥੨॥", Hindi = "सो ब्रहमु अजोनी है भी होनी घट भीतरि देखु मुरारी जीउ ॥२॥" },
                new { Gurmukhi = "ਜ਼ਨੇ ਪੇਚ ਦਸਤਾਰ ਰਾ ਤਾਬਦਾਦ ॥", Hindi = "ज़ने पेच दसतार रा ताबदाद ॥" },
                new { Gurmukhi = "ਸਉਡਿਸਇਸ ਇਸ ਇਸਣੀ ਆਦਿ ਬਖਾਨਿ ਕੈ ॥", Hindi = "सउडिसइस इस इसणी आदि बखानि कै ॥" },
                new { Gurmukhi = "ਅਜ਼ੋ ਗਸ਼ਤਾ ਹਰ ਜ਼ੱਰਰਾ ਖ਼ੁਰਸ਼ੈਦ ਤਾਬ ॥੯੬॥", Hindi = "अज़ो गशता हर ज़ररा क़ुरशैद ताब ॥९६॥" },
                new { Gurmukhi = "ਹਮਾ ਸਾਇਲਿ ਲੁਤਫ਼ਿ ਹਕ ਪਰਵਰਸ਼ ॥", Hindi = "हमा साइलि लुतफ़ि हक परवरश ॥" },
                new { Gurmukhi = "ਸੁ ਬੈਠਿ ਇਕੰਤ੍ਰ ॥੫੭੮॥", Hindi = "सु बैठि इकंत्र ॥५७८॥" },
                new { Gurmukhi = "ਇਤਿ ਸ੍ਰੀ ਬਚਿਤ੍ਰ ਨਾਟਕੇ ਮਨੁ ਰਾਜਾ ਕੋ ਰਾਜ ਸਮਾਪਤੰ ॥੧॥੫॥", Hindi = "इति स्री बचित्र नाटके मनु राजा को राज समापतं ॥१॥५॥" },
                new { Gurmukhi = "ਢਾਕਨਹਾਰੇ ਪ੍ਰਭੂ ਹਮਾਰੇ ਜੀਅ ਪ੍ਰਾਨ ਸੁਖਦਾਤੇ ॥", Hindi = "ढाकनहारे प्रभू हमारे जीअ प्रान सुखदाते ॥" },
                new { Gurmukhi = "ਮੰਤ੍ਰੁ", Hindi = "मंत्रु" },
                new { Gurmukhi = "ਤਿਸੁ ਵਿਣੁ ਸਭੁ ਅਪਵਿਤ੍ਰੁ ਹੈ ਜੇਤਾ ਪੈਨਣੁ ਖਾਣੁ ॥", Hindi = "तिसु विणु सभु अपवित्रु है जेता पैनणु खाणु ॥" },
                new { Gurmukhi = "ਸੋਢੀ ਸ੍ਰਿਸ੍ਟਿ ਸਕਲ ਤਾਰਣ ਕਉ ਅਬ ਗੁਰ ਰਾਮਦਾਸ ਕਉ ਮਿਲੀ ਬਡਾਈ ॥੩॥", Hindi = "सोढी स्रिस्टि सकल तारण कउ अब गुर रामदास कउ मिली बडाई ॥३॥" },
                new { Gurmukhi = "ਭੰਜਨ ਗੜ੍ਹਣ ਸਮਥੁ ਤਰਣ ਤਾਰਣ ਪ੍ਰਭੁ ਸੋਈ ॥", Hindi = "भंजन गढ़ण समथु तरण तारण प्रभु सोई ॥" },
                new { Gurmukhi = "ਰਾਗੁ ਗਉੜੀ ਥਿਤੰੀ ਕਬੀਰ ਜੀ ਕੰੀ ॥", Hindi = "रागु गउड़ी थितीं कबीर जी कीं ॥" },
                new { Gurmukhi = "ਹੁਕਮੈ ਅੰਦਰਿ. ਸਭੁ ਕੋ; ਬਾਹਰਿ ਹੁਕਮ. ਨ ਕੋਇ ॥", Hindi = "हुकमै अंदरि. सभु को; बाहरि हुकम. न कोइ ॥" },
            };

            Assert.All(words, w => Assert.Equal(GurmukhiUtils.ToHindi(w.Gurmukhi), w.Hindi));
        }
    }
}